### Importing Libraries

In [12]:
import pandas as pd
import numpy as np

### Create DataFrame

In [13]:
students = {
    "id": [1620, 1621, 1622, 1623, np.nan, 1625, 1626, np.nan],
    "first_name": ["Muhammad", "Ahmed", "NNNN", "Mustafa", "Marwan", "Muhammad", "NNNN", "Amr"],
    "last_name": ["Khalil", "Saleh", "Muhammad", "Saad", "Radwan", "N.A", "Hatem", "Gaber"],
    "level": [4, 2, 3, "n.a", 2, 3, 4, np.nan],
}

In [14]:
df = pd.DataFrame(students)
df

       id first_name last_name level
0  1620.0   Muhammad    Khalil     4
1  1621.0      Ahmed     Saleh     2
2  1622.0       NNNN  Muhammad     3
3  1623.0    Mustafa      Saad   n.a
4     NaN     Marwan    Radwan     2
5  1625.0   Muhammad       N.A     3
6  1626.0       NNNN     Hatem     4
7     NaN        Amr     Gaber   NaN

###  Handling Missing id

In [15]:
# Craete a range of ids in ordered way
ids = np.arange(1620, 1620 + df.shape[0])
ids

array([1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627])

In [16]:
# Beacuse Assuming That Ids are in order way
df["id"] = ids

In [17]:
df.set_index("id", inplace=True)

In [18]:
df

     first_name last_name level
id
1620   Muhammad    Khalil     4
1621      Ahmed     Saleh     2
1622       NNNN  Muhammad     3
1623    Mustafa      Saad   n.a
1624     Marwan    Radwan     2
1625   Muhammad       N.A     3
1626       NNNN     Hatem     4
1627        Amr     Gaber   NaN

### Handling Other Columns

In [19]:
# Handling custome NaN Values In Each Column Using Dummy Custom Values
# You Can Change It by Values Suitable For You
df.replace({
    "first_name": "NNNN",
    "last_name": "N.A", 
    "level": ["n.a", np.nan]
    
}, value={
    "first_name": np.nan, "last_name": np.nan, "level": 0
}, inplace=True)

In [21]:
df["level"] = df["level"].astype(np.int16)

In [22]:
df

     first_name last_name  level
id
1620   Muhammad    Khalil      4
1621      Ahmed     Saleh      2
1622        NaN  Muhammad      3
1623    Mustafa      Saad      0
1624     Marwan    Radwan      2
1625   Muhammad       NaN      3
1626        NaN     Hatem      4
1627        Amr     Gaber      0

### Drop Records That Contain NaN

In [25]:
df.dropna(how="any", subset=["first_name", "last_name"])

     first_name last_name  level
id
1620   Muhammad    Khalil      4
1621      Ahmed     Saleh      2
1623    Mustafa      Saad      0
1624     Marwan    Radwan      2
1627        Amr     Gaber      0